ers.yaml
config:
  target: "http://localhost/tutorial/codeigniter/api"
  phases:
    - duration: 10
      arrivalRate: 10
    # - duration: 600
    #   arrivalRate: 50
  processor: "./my-functions.js"

scenarios:
  - name: "Register a user"
    flow:
      # call generateRandomData() to create the name, email, and password variables
      - function: "generateRandomData"
      - post:
          url: "/insert"
          formData:
            first_name: "{{ name }}"
            last_name: "{{ lastname }}"
      # Print the data we're sending while debugging the script:
      - log: "Sent a request to /users with {{ name }}, {{ lastname }}"